'use strict';

// 9 урок. Операторы (Сложение, вычитание, умножение, деление)

console.log('arr' + '- object');

console.log('4' + +'5');


// Инкримент+ дикримент

let incr =10,
    decr = 10;

    incr++;
    // Увеличение

    decr--;
    // Уменьшение

    // Постфиксная возвращает сначала старое значение, 
    // а только потом прибавляется.

    // В префиксной сразу же

    console.log(5%2);
    // Это остаток от деления

    console.log(2*4 == 8);

    console.log(2*4 === 8);
// Строгое равенство

// && - и
// || — или
// ! — отрицание(обращает значение в обратное)
// != не равен
// !== строго не равен. Включая тип

const isChecked = true,
      isClose =true;
console.log(isChecked && isClose);


    

    